EE990/HW_eeromWriter/EEPROM/library/Device/Holtek/HT32F520xx/Include/ht32f520xx_01.h
/**
 * @brief Universal Serial Bus Endpoint
 */
typedef struct
{
                                 /* USB Endpoint0: 0x400A8014                                               */
                                 /* USB Endpoint1: 0x400A8028                                               */
                                 /* USB Endpoint2: 0x400A803C                                               */
                                 /* USB Endpoint3: 0x400A8050                                               */
                                 /* USB Endpoint4: 0x400A8064                                               */
                                 /* USB Endpoint5: 0x400A8078                                               */
                                 /* USB Endpoint6: 0x400A808C                                               */
                                 /* USB Endpoint7: 0x400A80A0                                               */
  __IO uint32_t CSR;             /*!< 0x000 USB Endpoint n Control and Status Register                      */
  __IO uint32_t IER;             /*!< 0x004 USB Endpoint n Interrupt Enable Register                        */
  __IO uint32_t ISR;             /*!< 0x008 USB Endpoint n Interrupt Status Register                        */
  __IO uint32_t TCR;             /*!< 0x00C USB Endpoint n Transfer Count Register                          */
  __IO uint32_t CFGR;            /*!< 0x010 USB Endpoint n Configuration Register                           */
} HT_USBEP_TypeDef;


/**
 * @brief External Bus Interface
 */
typedef struct
{
                                 /* EBI: 0x40098000                                                         */
  __IO uint32_t CR;              /*!< 0x000    EBI Control Register                                         */
       uint32_t RESERVED0[1];    /*!< 0x004    Reserved                                                     */
  __IO uint32_t SR;              /*!< 0x008    EBI Status Register                                          */
       uint32_t RESERVED1[1];    /*!< 0x00C    Reserved                                                     */
  __IO uint32_t ATR;             /*!< 0x010    EBI Address Timing Register                                  */
  __IO uint32_t RTR;             /*!< 0x014    EBI Read Timing Register                                     */
  __IO uint32_t WTR;             /*!< 0x018    EBI Write Timing Register                                    */
  __IO uint32_t PR;              /*!< 0x01C    EBI Parity Register                                          */
} HT_EBI_TypeDef;


/**
 * @brief Cyclic Redundancy Check
 */
typedef struct
{
                                  /* CRC: 0x4008A000                                                        */
  __IO uint32_t CR;               /*!< 0x000 CRC Control Register                                           */
  __IO uint32_t SDR;              /*!< 0x004 CRC Seed Register                                              */
  __IO uint32_t CSR;              /*!< 0x008 CRC Checksum Register                                          */
  __IO uint32_t DR;               /*!< 0x00C CRC Data Register                                              */
} HT_CRC_TypeDef;


/**
 * @brief Single Channel Timer
 */
typedef struct
{
                                  /* SCTM0: 0x40034000                                                      */
                                  /* SCTM1: 0x40074000                                                      */
                                  /* SCTM2: 0x40035000                                                      */
                                  /* SCTM3: 0x40075000                                                      */
  __IO uint32_t CNTCFR;          /*!< 0x000          Counter Configuration Register                         */
  __IO uint32_t MDCFR;           /*!< 0x004          Mode Configuration Register                            */
  __IO uint32_t TRCFR;           /*!< 0x008          Trigger Configuration Register                         */
       uint32_t RESERVED0[1];    /*!< 0x00C          Reserved                                               */
  __IO uint32_t CTR;             /*!< 0x010          Control Register                                       */
       uint32_t RESERVED1[3];    /*!< 0x014 - 0x01C  Reserved                                               */
  __IO uint32_t CHICFR;          /*!< 0x020          Channel Input Configuration Register                   */
       uint32_t RESERVED2[7];    /*!< 0x024 - 0x03C  Reserved                                               */
  __IO uint32_t CHOCFR;          /*!< 0x040          Channel Output Configuration Register                  */
       uint32_t RESERVED3[3];    /*!< 0x044 - 0x04C  Reserved                                               */
  __IO uint32_t CHCTR;           /*!< 0x050          Channel Control Register                               */
  __IO uint32_t CHPOLR;          /*!< 0x054          Channel Polarity Configuration Register                */
       uint32_t RESERVED4[7];    /*!< 0x058 - 0x070  Reserved                                               */
  __IO uint32_t DICTR;           /*!< 0x074          Interrupt Control Register                             */
  __IO uint32_t EVGR;            /*!< 0x078          Event Generator Register                               */
  __IO uint32_t INTSR;           /*!< 0x07C          Interrupt Status Register                              */
  __IO uint32_t CNTR;            /*!< 0x080          Counter Register                                       */
  __IO uint32_t PSCR;            /*!< 0x084          Prescaler Register                                     */
  __IO uint32_t CRR;             /*!< 0x088          Counter Reload Register                                */
       uint32_t RESERVED5[1];    /*!< 0x090          Reserved                                               */
  __IO uint32_t CHCCR;           /*!< 0x090          Channel Capture/Compare Register                     */
} HT_SCTM_TypeDef;


/**
 * @brief Integrated Interchip Sound
 */
typedef struct
{
                                  /* I2S: 0x40026000                                                        */
  __IO uint32_t CR;               /*!< 0x000 I2S Control Register                                           */
  __IO uint32_t IER;              /*!< 0x004 I2S Interrupt Enable Register                                  */
  __IO uint32_t CDR;              /*!< 0x008 I2S Clock Divider Register                                     */
  __IO uint32_t TXDR;             /*!< 0x00C I2S TX Data Register                                           */
  __IO uint32_t RXDR;             /*!< 0x010 I2S RX Data Register                                           */
  __IO uint32_t FCR;              /*!< 0x014 I2S FIFO Control Register                                      */
  __IO uint32_t SR;               /*!< 0x018 I2S Status Register                                            */
  __IO uint32_t RCNTR;            /*!< 0x01C I2S Rate Counter Register                                      */
} HT_I2S_TypeDef;


/**
  * @}
  */


/** @addtogroup Peripheral_Memory_Map
  * @{
  */

