EE990/HW_eeromWriter/EEPROM/library/Device/Holtek/HT32F520xx/Include/ht32f520xx_01.h
#define HT_SRAM_BASE             ((u32)0x20000000)

#define HT_PERIPH_BASE           ((u32)0x40000000)

#define HT_APBPERIPH_BASE        (HT_PERIPH_BASE)                 /* 0x40000000                             */
#define HT_AHBPERIPH_BASE        (HT_PERIPH_BASE + 0x80000)       /* 0x40080000                             */

/* APB                                                                                                      */
#define HT_USART0_BASE           (HT_APBPERIPH_BASE + 0x0000)     /* 0x40000000                             */
#define HT_UART0_BASE            (HT_APBPERIPH_BASE + 0x1000)     /* 0x40001000                             */
#define HT_SPI0_BASE             (HT_APBPERIPH_BASE + 0x4000)     /* 0x40004000                             */
#define HT_ADC_BASE              (HT_APBPERIPH_BASE + 0x10000)    /* 0x40010000                             */
#define HT_AFIO_BASE             (HT_APBPERIPH_BASE + 0x22000)    /* 0x40022000                             */
#define HT_EXTI_BASE             (HT_APBPERIPH_BASE + 0x24000)    /* 0x40024000                             */
#define HT_I2S_BASE              (HT_APBPERIPH_BASE + 0x26000)    /* 0x40026000                             */
#define HT_MCTM0_BASE            (HT_APBPERIPH_BASE + 0x2C000)    /* 0x4002C000                             */
#define HT_SCTM0_BASE            (HT_APBPERIPH_BASE + 0x34000)    /* 0x40034000                             */
#define HT_SCTM2_BASE            (HT_APBPERIPH_BASE + 0x35000)    /* 0x40035000                             */
#define HT_SCI1_BASE             (HT_APBPERIPH_BASE + 0x3A000)    /* 0x4003A000                             */
#define HT_USART1_BASE           (HT_APBPERIPH_BASE + 0x40000)    /* 0x40040000                             */
#define HT_UART1_BASE            (HT_APBPERIPH_BASE + 0x41000)    /* 0x40041000                             */
#define HT_SCI0_BASE             (HT_APBPERIPH_BASE + 0x43000)    /* 0x40043000                             */
#define HT_SPI1_BASE             (HT_APBPERIPH_BASE + 0x44000)    /* 0x40044000                             */
#define HT_I2C0_BASE             (HT_APBPERIPH_BASE + 0x48000)    /* 0x40048000                             */
#define HT_I2C1_BASE             (HT_APBPERIPH_BASE + 0x49000)    /* 0x40049000                             */
#define HT_CMP0_BASE             (HT_APBPERIPH_BASE + 0x58000)    /* 0x40058000                             */
#define HT_CMP1_BASE             (HT_APBPERIPH_BASE + 0x58100)    /* 0x40058100                             */
#define HT_WDT_BASE              (HT_APBPERIPH_BASE + 0x68000)    /* 0x40068000                             */
#define HT_RTC_BASE              (HT_APBPERIPH_BASE + 0x6A000)    /* 0x4006A000                             */
#define HT_PWRCU_BASE            (HT_APBPERIPH_BASE + 0x6A100)    /* 0x4006A100                             */
#define HT_GPTM0_BASE            (HT_APBPERIPH_BASE + 0x6E000)    /* 0x4006E000                             */
#define HT_GPTM1_BASE            (HT_APBPERIPH_BASE + 0x6F000)    /* 0x4006F000                             */
#define HT_SCTM1_BASE            (HT_APBPERIPH_BASE + 0x74000)    /* 0x40074000                             */
#define HT_SCTM3_BASE            (HT_APBPERIPH_BASE + 0x75000)    /* 0x40075000                             */
#define HT_BFTM0_BASE            (HT_APBPERIPH_BASE + 0x76000)    /* 0x40076000                             */
#define HT_BFTM1_BASE            (HT_APBPERIPH_BASE + 0x77000)    /* 0x40077000                             */

/* AHB                                                                                                      */
#define HT_FLASH_BASE            (HT_AHBPERIPH_BASE + 0x0000)     /* 0x40080000                             */
#define HT_CKCU_BASE             (HT_AHBPERIPH_BASE + 0x8000)     /* 0x40088000                             */
#define HT_RSTCU_BASE            (HT_AHBPERIPH_BASE + 0x8100)     /* 0x40088100                             */
#define HT_CRC_BASE              (HT_AHBPERIPH_BASE + 0xA000)     /* 0x4008A000                             */
#define HT_PDMA_BASE             (HT_AHBPERIPH_BASE + 0x10000)    /* 0x40090000                             */
#define HT_EBI_BASE              (HT_AHBPERIPH_BASE + 0x18000)    /* 0x40098000                             */
#define HT_USB_BASE              (HT_AHBPERIPH_BASE + 0x28000)    /* 0x400A8000                             */
#define HT_USB_EP0_BASE          (HT_USB_BASE       + 0x0014)     /* 0x400A8014                             */
#define HT_USB_EP1_BASE          (HT_USB_BASE       + 0x0028)     /* 0x400A8028                             */
#define HT_USB_EP2_BASE          (HT_USB_BASE       + 0x003C)     /* 0x400A803C                             */
#define HT_USB_EP3_BASE          (HT_USB_BASE       + 0x0050)     /* 0x400A8050                             */
#define HT_USB_EP4_BASE          (HT_USB_BASE       + 0x0064)     /* 0x400A8064                             */
#define HT_USB_EP5_BASE          (HT_USB_BASE       + 0x0078)     /* 0x400A8078                             */
#define HT_USB_EP6_BASE          (HT_USB_BASE       + 0x008C)     /* 0x400A808C                             */
#define HT_USB_EP7_BASE          (HT_USB_BASE       + 0x00A0)     /* 0x400A80A0                             */
#define HT_USB_SRAM_BASE         (HT_AHBPERIPH_BASE + 0x2A000)    /* 0x400AA000                             */
#define HT_GPIOA_BASE            (HT_AHBPERIPH_BASE + 0x30000)    /* 0x400B0000                             */
#define HT_GPIOB_BASE            (HT_AHBPERIPH_BASE + 0x32000)    /* 0x400B2000                             */
#define HT_GPIOC_BASE            (HT_AHBPERIPH_BASE + 0x34000)    /* 0x400B4000                             */
#define HT_GPIOD_BASE            (HT_AHBPERIPH_BASE + 0x36000)    /* 0x400B6000                             */



/**
  * @}
  */

/* Peripheral declaration                                                                                   */
#define HT_USART0              ((HT_USART_TypeDef *) HT_USART0_BASE)
#define HT_UART0               ((HT_USART_TypeDef *) HT_UART0_BASE)
#define HT_SPI0                ((HT_SPI_TypeDef *) HT_SPI0_BASE)
#define HT_I2C0                ((HT_I2C_TypeDef *) HT_I2C0_BASE)
#define HT_ADC                 ((HT_ADC_TypeDef *) HT_ADC_BASE)
#define HT_AFIO                ((HT_AFIO_TypeDef *) HT_AFIO_BASE)
#define HT_EXTI                ((HT_EXTI_TypeDef *) HT_EXTI_BASE)
#define HT_WDT                 ((HT_WDT_TypeDef *) HT_WDT_BASE)
#define HT_PWRCU               ((HT_PWRCU_TypeDef *) HT_PWRCU_BASE)
#define HT_SCTM0               ((HT_TM_TypeDef *) HT_SCTM0_BASE)
#define HT_SCTM1               ((HT_TM_TypeDef *) HT_SCTM1_BASE)
#define HT_GPTM0               ((HT_TM_TypeDef *) HT_GPTM0_BASE)
#define HT_BFTM0               ((HT_BFTM_TypeDef *) HT_BFTM0_BASE)
#define HT_FLASH               ((HT_FLASH_TypeDef *) HT_FLASH_BASE)
#define HT_CKCU                ((HT_CKCU_TypeDef *) HT_CKCU_BASE)
#define HT_RSTCU               ((HT_RSTCU_TypeDef *) HT_RSTCU_BASE)
#define HT_GPIOA               ((HT_GPIO_TypeDef *) HT_GPIOA_BASE)
#define HT_GPIOB               ((HT_GPIO_TypeDef *) HT_GPIOB_BASE)

#if defined(USE_HT32F52231_41) || defined(USE_HT32F52331_41) || defined(USE_HT32F52342_52)
#define HT_UART1               ((HT_USART_TypeDef *) HT_UART1_BASE)
#define HT_SPI1                ((HT_SPI_TypeDef *) HT_SPI1_BASE)
#define HT_I2C1                ((HT_I2C_TypeDef *) HT_I2C1_BASE)
#define HT_RTC                 ((HT_RTC_TypeDef *) HT_RTC_BASE)
#define HT_MCTM0               ((HT_TM_TypeDef *) HT_MCTM0_BASE)
#define HT_BFTM1               ((HT_BFTM_TypeDef *) HT_BFTM1_BASE)
#define HT_CRC                 ((HT_CRC_TypeDef *) HT_CRC_BASE)
#define HT_GPIOC               ((HT_GPIO_TypeDef *) HT_GPIOC_BASE)
#endif

