EE990/HW_eeromWriter/EEPROM/library/Device/Holtek/HT32F520xx/Include/ht32f520xx_01.h
#if defined(USE_HT32F52231_41) || defined(USE_HT32F52331_41)
#define HT_SCTM2               ((HT_TM_TypeDef *) HT_SCTM2_BASE)
#define HT_SCTM3               ((HT_TM_TypeDef *) HT_SCTM3_BASE)
#endif

#if defined(USE_HT32F52331_41) || defined(USE_HT32F52342_52)
#define HT_SCI0                ((HT_SCI_TypeDef *) HT_SCI0_BASE)
#define HT_USB                 ((HT_USB_TypeDef *) HT_USB_BASE)
#define HT_USBEP0              ((HT_USBEP_TypeDef *) HT_USB_EP0_BASE)
#define HT_USBEP1              ((HT_USBEP_TypeDef *) HT_USB_EP1_BASE)
#define HT_USBEP2              ((HT_USBEP_TypeDef *) HT_USB_EP2_BASE)
#define HT_USBEP3              ((HT_USBEP_TypeDef *) HT_USB_EP3_BASE)
#define HT_USBEP4              ((HT_USBEP_TypeDef *) HT_USB_EP4_BASE)
#define HT_USBEP5              ((HT_USBEP_TypeDef *) HT_USB_EP5_BASE)
#define HT_USBEP6              ((HT_USBEP_TypeDef *) HT_USB_EP6_BASE)
#define HT_USBEP7              ((HT_USBEP_TypeDef *) HT_USB_EP7_BASE)
#endif

#if defined(USE_HT32F52342_52)
#define HT_USART1              ((HT_USART_TypeDef *) HT_USART1_BASE)
#define HT_CMP0                ((HT_CMP_TypeDef *) HT_CMP0_BASE)
#define HT_CMP1                ((HT_CMP_TypeDef *) HT_CMP1_BASE)
#define HT_I2S                 ((HT_I2S_TypeDef *) HT_I2S_BASE)
#define HT_GPTM1               ((HT_TM_TypeDef *) HT_GPTM1_BASE)
#define HT_PDMA                ((HT_PDMA_TypeDef *) HT_PDMA_BASE)
#define HT_EBI                 ((HT_EBI_TypeDef *) HT_EBI_BASE)
#define HT_GPIOD               ((HT_GPIO_TypeDef *) HT_GPIOD_BASE)
#define HT_SCI1                ((HT_SCI_TypeDef *) HT_SCI1_BASE)
#endif

#if defined USE_HT32_DRIVER
  #include "ht32f520xx_lib.h"
#endif


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif


/**
  * @}
  */

/**
  * @}
  */

/******************* (C) COPYRIGHT Holtek Semiconductor Inc. *****END OF FILE***                            */
